experiment_script/graph/Fig-1.FS-GC_VS_Dev-GC/devgc/fio_exp_output_raw_device_20241226_1416/randwrite/raw_device/1/result_4k.txt
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.32
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=2660: Thu Dec 26 14:43:05 2024
  write: IOPS=218k, BW=851MiB/s (892MB/s)(997GiB/1200001msec); 0 zone resets
    clat (nsec): min=739, max=949130, avg=4253.28, stdev=1926.22
     lat (nsec): min=789, max=949184, avg=4305.75, stdev=1932.78
    clat percentiles (nsec):
     |  1.00th=[ 2128],  5.00th=[ 2608], 10.00th=[ 2832], 20.00th=[ 3088],
     | 30.00th=[ 3344], 40.00th=[ 3632], 50.00th=[ 3824], 60.00th=[ 4016],
     | 70.00th=[ 4192], 80.00th=[ 4704], 90.00th=[ 6752], 95.00th=[ 8256],
     | 99.00th=[10560], 99.50th=[11840], 99.90th=[16064], 99.95th=[18304],
     | 99.99th=[45312]
   bw (  KiB/s): min=164704, max=1315032, per=100.00%, avg=871530.52, stdev=118899.03, samples=2399
   iops        : min=137843, max=315953, avg=217901.10, stdev=27163.22, samples=599
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.41%, 4=59.56%, 10=38.62%, 20=1.37%, 50=0.03%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=11.69%, sys=88.27%, ctx=122714, majf=0, minf=96
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,261346340,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=851MiB/s (892MB/s), 851MiB/s-851MiB/s (892MB/s-892MB/s), io=997GiB (1070GB), run=1200001-1200001msec

Disk stats (read/write):
  nvme2n1: ios=29/239566417, merge=0/13416910, ticks=14/42120198, in_queue=42120212, util=76.33%